_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
batch_normalization_1 (Batch (None, 646, 96, 1)        4         
_________________________________________________________________
conv_1 (Conv2D)              (None, 646, 96, 32)       320       
_________________________________________________________________
max_pool_1 (MaxPooling2D)    (None, 323, 48, 32)       0         
_________________________________________________________________
conv_2 (Conv2D)              (None, 323, 48, 64)       18496     
_________________________________________________________________
max_pool_2 (MaxPooling2D)    (None, 161, 24, 64)       0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 247296)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               31654016  
_________________________________________________________________
dropout_1 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 129       
=================================================================
Total params: 31,672,965
Trainable params: 31,672,963
Non-trainable params: 2
_________________________________________________________________
