_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
batch_normalization_2 (Batch (None, 646, 96, 1)        4         
_________________________________________________________________
conv_1 (Conv2D)              (None, 646, 96, 32)       1952      
_________________________________________________________________
max_pool_1 (MaxPooling2D)    (None, 6, 96, 32)         0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 18432)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 200)               3686600   
_________________________________________________________________
dropout_1 (Dropout)          (None, 200)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 201       
=================================================================
Total params: 3,688,757
Trainable params: 3,688,755
Non-trainable params: 2
_________________________________________________________________
